/* errAuthorizationInvalidSet */
"-60001" = "Os direitos de autorização são inválidos.";

/* errAuthorizationInvalidRef */
"-60002" = "A referência de autorização é inválida.";

/* errAuthorizationInvalidTag */
"-60003" = "A etiqueta de autorização é inválida.";

/* errAuthorizationInvalidPointer */
"-60004" = "A autorização retornada é inválida.";

/* errAuthorizationDenied */
"-60005" = "A autorização foi negada.";

/* errAuthorizationCanceled */
"-60006" = "A autorização foi cancelada pelo usuário.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "A autorização foi negada porque nenhuma interação do usuário era possível.";

/* errAuthorizationInternal */
"-60008" = "não foi possível obter uma autorização para esta operação.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "A autorização não possui permissão para ser convertida a um formato externo.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "A autorização não possui permissão para ser criada a partir de um formato externo.";

/* errAuthorizationInvalidFlags */
"-60011" = "A(s) sinalização(ções) de opção fornecida(s) é (são) inválida(s) para esta operação de autorização.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "O programa especificado não pôde ser executado.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Um estado inválido foi retornado durante a execução de uma ferramenta privilegiada.";

/* errAuthorizationBadAddress */
"-60033" = "O endereço de soquete requerido é inválido (deve estar entre 0-1023 inclusive).";

/* errSSLProtocol */
"-9800" = "Erro de protocolo SSL";

/* errSSLNegotiation */
"-9801" = "Falha de negociação de Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Alerta fatal";

/* errSSLWouldBlock */
"-9803" = "E/S ficariam bloqueadas (não é fatal)";

/* errSSLSessionNotFound */
"-9804" = "tentativa de restaurar uma sessão desconhecida";

/* errSSLClosedGraceful */
"-9805" = "a conexão fechou-se elegantemente";

/* errSSLClosedAbort */
"-9806" = "a conexão fechou-se via erro";

/* errSSLXCertChainInvalid */
"-9807" = "cadeia de certificado inválida";

/* errSSLBadCert */
"-9808" = "formato de certificado inválido";

/* errSSLCrypto */
"-9809" = "erro criptográfico subjacente";

/* errSSLInternal */
"-9810" = "Erro interno";

/* errSSLModuleAttach */
"-9811" = "falha de conexão de módulo";

/* errSSLUnknownRootCert */
"-9812" = "cadeia de cert. válida, raiz não confiável";

/* errSSLNoRootCert */
"-9813" = "cadeia de cert. não verificada pela raiz";

/* errSSLCertExpired */
"-9814" = "cadeia tinha cert. expirado";

/* errSSLCertNotYetValid */
"-9815" = "cadeia tinha cert. ainda não válido";

/* errSSLClosedNoNotify */
"-9816" = "o servidor fechou a sessão sem aviso";

/* errSSLBufferOverflow */
"-9817" = "foi fornecido insuficiente armaz. intermediário";

/* errSSLBadCipherSuite */
"-9818" = "SSLCipherSuite inválido";

/* errSSLPeerUnexpectedMsg */
"-9819" = "foi recebida uma mensagem não esperada";

/* errSSLPeerBadRecordMac */
"-9820" = "MAC inválido";

/* errSSLPeerDecryptionFail */
"-9821" = "a decriptação falhou";

/* errSSLPeerRecordOverflow */
"-9822" = "saturação de registro";

/* errSSLPeerDecompressFail */
"-9823" = "falha de descompressão";

/* errSSLPeerHandshakeFail */
"-9824" = "falha de negociação";

/* errSSLPeerBadCert */
"-9825" = "certificado inválido diverso";

/* errSSLPeerUnsupportedCert */
"-9826" = "formato de cert. inválido não compatível";

/* errSSLPeerCertRevoked */
"-9827" = "certificado revogado";

/* errSSLPeerCertExpired */
"-9828" = "certificado expirado";

/* errSSLPeerCertUnknown */
"-9829" = "certificado desconhecido";

/* errSSLIllegalParam */
"-9830" = "parâmetro ilegal";

/* errSSLPeerUnknownCA */
"-9831" = "Autoridade de Cert. desconhecida";

/* errSSLPeerAccessDenied */
"-9832" = "acesso negado";

/* errSSLPeerDecodeError */
"-9833" = "erro de decodificação";

/* errSSLPeerDecryptError */
"-9834" = "erro de decriptação";

/* errSSLPeerExportRestriction */
"-9835" = "restrição de exportação";

/* errSSLPeerProtocolVersion */
"-9836" = "versão de protocolo inválida";

/* errSSLPeerInsufficientSecurity */
"-9837" = "segurança insuficiente";

/* errSSLPeerInternalError */
"-9838" = "erro interno";

/* errSSLPeerUserCancelled */
"-9839" = "cancelado pelo usuário";

/* errSSLPeerNoRenegotiation */
"-9840" = "nenhuma renegociação permitida";

/* errSSLServerAuthCompleted */
"-9841" = "o certificado do servidor é válido ou foi ignorado se a verificação foi desativada";

/* errSSLClientCertRequested */
"-9842" = "o servidor solicitou um certificado de cliente";

/* errSSLHostNameMismatch */
"-9843" = "incongruência no nome do host";

/* errSSLConnectionRefused */
"-9844" = "o par derrubou a conexão antes de responder";

/* errSSLDecryptionFail */
"-9845" = "falha de decriptação";

/* errSSLBadRecordMac */
"-9846" = "MAC inválido";

/* errSSLRecordOverflow */
"-9847" = "saturação de registro";

/* errSSLBadConfiguration */
"-9848" = "erro de configuração";

/* errSecSuccess */
"0" = "Nenhum erro.";

/* errSecUnimplemented */
"-4" = "Função ou operação não implementada.";

/* errSecParam */
"-50" = "Um ou mais parâmetros passados a uma função não eram válidos.";

/* errSecAllocate */
"-108" = "Falhou ao alocar a memória.";

/* errSecNotAvailable */
"-25291" = "Não há chaves disponíveis. Talvez seja necessário reiniciar o seu computador.";

/* errSecReadOnly */
"-25292" = "Estas chaves não podem ser modificadas.";

/* errSecAuthFailed */
"-25293" = "O nome de usuário ou a frase-senha que você digitou não é correto.";

/* errSecNoSuchKeychain */
"-25294" = "As chaves especificadas não foram encontradas.";

/* errSecInvalidKeychain */
"-25295" = "As chaves especificadas não são arquivos de chave válidos.";

/* errSecDuplicateKeychain */
"-25296" = "Já há umas chaves com o mesmo nome.";

/* errSecDuplicateCallback */
"-25297" = "A função de retorno de chamada especificada já está instalada.";

/* errSecInvalidCallback */
"-25298" = "A função de retorno de chamada especificada não é válida.";

/* errSecDuplicateItem */
"-25299" = "O item especificado já existe nas chaves.";

/* errSecItemNotFound */
"-25300" = "O item especificado não pôde ser encontrado nas chaves.";

/* errSecBufferTooSmall */
"-25301" = "Não há memória disponível suficiente para usar o item especificado.";

/* errSecDataTooLarge */
"-25302" = "Este item contém informações que são muito grandes ou que estão em um formato que não pode ser exibido.";

/* errSecNoSuchAttr */
"-25303" = "O atributo especificado não existe.";

/* errSecInvalidItemRef */
"-25304" = "O item especificado não é mais válido. Talvez tenha sido apagado das chaves.";

/* errSecInvalidSearchRef */
"-25305" = "Não foi possível buscar nas chaves atuais.";

/* errSecNoSuchClass */
"-25306" = "O item especificado não parece ser um item de chaves válido.";

/* errSecNoDefaultKeychain */
"-25307" = "Não foram encontradas chaves padrão.";

/* errSecInteractionNotAllowed */
"-25308" = "A interação do usuário não é permitida.";

/* errSecReadOnlyAttr */
"-25309" = "O atributo especificado não pôde ser modificado.";

/* errSecWrongSecVersion */
"-25310" = "Estas chaves foram criadas por uma versão diferente do software do sistema e não podem ser abertas.";

/* errSecKeySizeNotAllowed */
"-25311" = "Este item especifica um tamanho de chaves que é muito grande.";

/* errSecNoStorageModule */
"-25312" = "Um componente necessário (módulo de armazenamento de dados) não pôde ser carregado. Talvez seja necessário reiniciar o seu computador.";

/* errSecNoCertificateModule */
"-25313" = "Um componente necessário (módulo de certificado) não pôde ser carregado. Talvez seja necessário reiniciar o seu computador.";

/* errSecNoPolicyModule */
"-25314" = "Um componente necessário (módulo de política) não pôde ser carregado. Talvez seja necessário reiniciar o seu computador.";

/* errSecInteractionRequired */
"-25315" = "A interação do usuário é necessária, mas não é permitida atualmente.";

/* errSecDataNotAvailable */
"-25316" = "O conteúdo deste item não pode ser obtido.";

/* errSecDataNotModifiable */
"-25317" = "O conteúdo deste item não pode ser modificado.";

/* errSecCreateChainFailed */
"-25318" = "Um ou mais de um certificado necessário para validar este certificado não pode ser encontrado.";

/* errSecInvalidPrefsDomain */
"-25319" = "O domínio de preferências especificado não é válido.";

/* errSecACLNotSimple */
"-25240" = "A lista de controle de acesso especificada não está em formato padrão (simples).";

/* errSecPolicyNotFound */
"-25241" = "A política especificada não foi encontrada.";

/* errSecInvalidTrustSetting */
"-25242" = "O ajuste de confiabilidade especificado é inválido.";

/* errSecNoAccessForItem */
"-25243" = "O item especificado não tem controle de acesso.";

/* errSecInvalidOwnerEdit */
"-25244" = "Tentativa inválida de alterar o proprietário deste item.";

/* errSecTrustNotAvailable */
"-25245" = "Não há nenhum resultado de confiabilidade disponível.";

/* errSecUnsupportedFormat */
"-25256" = "Formato de Importação/Exportação incompatível.";

/* errSecUnknownFormat */
"-25257" = "Formato desconhecido na importação.";

/* errSecKeyIsSensitive */
"-25258" = "O material chave deve ser ajustado para a exportação.";

/* errSecMultiplePrivKeys */
"-25259" = "Foi realizada uma tentativa de importar múltiplas chaves privadas.";

/* errSecPassphraseRequired */
"-25260" = "É necessária uma frase-senha para importar/exportar.";

/* errSecInvalidPasswordRef */
"-25261" = "A referência de senha era inválida.";

/* errSecInvalidTrustSettings */
"-25262" = "O Registro de Ajustes de Confiabilidade estava corrupto.";

/* errSecNoTrustSettings */
"-25263" = "Não foram encontrados Ajustes de Confiabilidade.";

/* errSecPkcs12VerifyFailure */
"-25264" = "A verificação MAC falhou durante a importação de PKCS12.";

/* errSecDecode */
"-26275" = "Não foi possível decodificar os dados fonecidos.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP Vector de Valores de Erro de Buffers.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Valores de Erro de Contexto de CSP Cryptographic.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Valores de Erro de CSP Staged Cryptographic API.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Foi feita uma tentativa para utilizar uma chave pública que está incompleta devido * à ausência de parâmetros algorítmicos específicos.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "uma coincidência de assinatura de código falhou";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "StartDate/EndDate da Chave inválido";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Códigos de erro da Sincronização das Chaves";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "Verificação de preenchimento SSLv2:  ataque de recarregamento detectado";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "O argumento OpenParameters passado a CSSM_DL_DbCreate ou CSSM_DL_DbOpen não foi nem NULL nem um ponteiro para uma estrutura CSSM_APPLEDL_OPEN_PARAMETERS válida.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "uma operação falhou porque o disco estava cheio";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "uma operação falhou porque uma cota de disco foi excedida";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "uma operação falhou porque um arquivo era muito grande";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "uma informação interna do banco de dados das chaves (\"blob\") é inválida";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "a versão do formato de dados internos para uma informação interna de um banco de dados (\"blob\") é inválida";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Incongruência de nome de host";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Extensão incompreensível com sinal Crítico verdadeiro";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Extensão de Restrições Básicas requeridas pela política, mas não presentes";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "BasicConstraints.CA Inválido";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "ID de Chave de Autoridade Inválido ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "ID de Chave de Sujeito Inválido ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Uso de Chave Inválido para política";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Uso de Chave Estendida Inválido para política";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Link de ID de Chave de Sujeito/Autoridade Inválido";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint excedida";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Grupo de certificado terminado em um certificado de raiz que não se auto-verificou";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL expirada/ainda não válida";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Não foi possível encontrar um CRL adequado";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Servidor CRL especificado não está disponível";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL de ponto de distribuição CRL ilegível";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Extensão cert/CRL crítica desconhecida";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL não verificável para âncora ou raiz";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verificada para raiz não confiável";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL falhou na verificação de política";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Violação de extensão de IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Cert. não encontrado no issuerAltName especificado";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Cert. inválido obtido do issuerAltName especificado";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Incongruência em endereço de e-mail S/MIME";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "ExtendedKeyUsage S/MIME adequado não encontrado ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Incompatibilidade de KeyUsage de S/MIME";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certificado com KeyUsage sinalizado !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, folha com nome de sujeito vazio e nenhum endereço de e-mail * em SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, folha com nome de sujeito vazio, SubjectAltName * não crítico";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "ExtendedKeyUsage de SSL adequado não encontrado";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "Resposta OCSP não verificável gramaticalmente";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "pedido de OCSP não verificável gramaticalmente";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "Serviço OCSP não disponível";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "Estado OCSP: certificado não reconhecido";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "verificação de revocação mal-sucedida para cada certificado";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "erro de rede geral";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "Resposta OCSP não verificável para âncora ou raiz";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "Resposta OCSP verificada para raiz não confiável";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Erro de assinatura de resposta OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Nenhum assinante para a resposta de OCSP encontrado";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "Estado de resposta de OCSP: pedido mal formulado";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "Estado de resposta de OCSP: erro interno";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "Estado de resposta de OCSP: tente mais tarde";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "Estado de resposta de OCSP: assinatura requerida";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "Estado de resposta de OCSP: não autorizado";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "A resposta OCSP presente não coincide com o pedido";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Comprimento de cadeia de certificado ilegal para Assinatura de Código";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Restrições Básicas Ausentes para Assinatura de Código";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint incorreto para Assinatura de Código";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "ExtendedKeyUsage Ausente para Assinatura de Código";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Certificado de Assinatura de Código de estilo de Desenvolvimento Detectado";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Comprimento de cadeia de certificado ilegal para Assinatura de Recurso";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "uso incorreto de chave estendida para Assinatura de Recurso";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Ajuste de Confiabilidade: negar";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "SubjectName inválido vazio";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ID de Instrução de Certificado Qualificado crítico desconhecido";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "pedido de certificado em fila";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "pedido de certificado redirecionado";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "Erro de servidor reportado geral";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "erro de parâmetro do servidor reportado";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "erro de autorização do servidor reportado";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "servidor reportado não implementado";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "servidor reportado não disponível";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "servidor reportado já existe";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "erro de serviço de servidor reportado";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "requerimento já pendente para o usuário especificado";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "nenhum requerimento pendente para o usuário especificado";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "Falha de CSR ao verificar";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "falha de verificação de consistência reportada pelo servidor";

/* errSecCSUnimplemented */
"-67072" = "recurso de assinatura de código não implementado";

/* errSecCSInvalidObjectRef */
"-67071" = "referência de objeto API inválido";

/* errSecCSInvalidFlags */
"-67070" = "especificadas sinalizações de API inválidas ou inapropriadas";

/* errSecCSObjectRequired */
"-67069" = "um argumento de ponteiro requerido foi NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "impossível encontrar objeto de código no disco";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "impossível localizar os convidados usando este conjunto de atributos";

/* errSecCSInvalidAttributeValues */
"-67066" = "os valores de atributo fornecidos são inválidos";

/* errSecCSNoSuchCode */
"-67065" = "o host não possui nenhum convidado com o atributo solicitado";

/* errSecCSMultipleGuests */
"-67064" = "o host possui muitos convidados com este valor de atributo";

/* errSecCSGuestInvalid */
"-67063" = "a identidade de código foi invalidada";

/* errSecCSUnsigned */
"-67062" = "o objeto de código não está assinado";

/* errSecCSSignatureFailed */
"-67061" = "código ou assinatura modificada";

/* errSecCSSignatureNotVerifiable */
"-67060" = "a assinatura não pode ser lida, por exemplo, devido a um sistema de arquivos que mapeia a raiz para um usuário sem privilégios";

/* errSecCSSignatureUnsupported */
"-67059" = "tipo ou versão de assinatura incompatível";

/* errSecCSBadDictionaryFormat */
"-67058" = "um arquivo ou recurso plist está mal formado";

/* errSecCSResourcesNotSealed */
"-67057" = "os recursos não estão autenticados com uma assinatura";

/* errSecCSResourcesNotFound */
"-67056" = "impossível encontrar recursos de autenticação no código";

/* errSecCSResourcesInvalid */
"-67055" = "o diretório do recurso de autenticação é inválido";

/* errSecCSBadResource */
"-67054" = "um recurso de autenticação está faltando ou é inválido";

/* errSecCSResourceRulesInvalid */
"-67053" = "regra(s) de seleção de recurso inválida(s)";

/* errSecCSReqInvalid */
"-67052" = "requerimento(s) de código inválido(s) ou corrupto(s)";

/* errSecCSReqUnsupported */
"-67051" = "tipo ou versão incompatível de requerimento(s) de código";

/* errSecCSReqFailed */
"-67050" = "falhou ao satisfazer o(s) requerimento(s) de código";

/* errSecCSBadObjectFormat */
"-67049" = "formato de arquivo inválido ou inadequado";

/* errSecCSInternalError */
"-67048" = "erro interno no subsistema de Assinatura de Código";

/* errSecCSHostReject */
"-67047" = "código rejeitou seu host";

/* errSecCSNotAHost */
"-67046" = "este código não é um host";

/* errSecCSSignatureInvalid */
"-67045" = "formato inválido de assinatura";

/* errSecCSHostProtocolRelativePath */
"-67044" = "violação de protocolo de host - caminho de convidado absoluto solicitado";

/* errSecCSHostProtocolContradiction */
"-67043" = "violação de protocolo de host - modos de hospedagem contraditórios";

/* errSecCSHostProtocolDedicationError */
"-67042" = "violação de protocolo de host - operação não permitida com/para um convidado dedicado";

/* errSecCSHostProtocolNotProxy */
"-67041" = "violação de protocolo de host - host de proxy não acoplado";

/* errSecCSHostProtocolStateError */
"-67040" = "violação de protocolo de host - pedido de alteração de estado de convidado inválido";

/* errSecCSHostProtocolUnrelated */
"-67039" = "violação de protocolo de host - o convidado fornecido não é um convidado do host";

/* errSecCSInvalidOperation */
"-67038" = "a operação requerida não é válida";

/* errSecCSNotSupported */
"-67037" = "operação não compatível com este tipo de código";

/* errSecCSCMSTooLarge */
"-67036" = "a assinatura é muito longa para ser integrada";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "violação de protocolo de host - número de convidado inválido";

/* errSecCSStaticCodeChanged */
"-67034" = "o programa no disco não coincide com o que está sendo executado";

/* errSecCSSigDBDenied */
"-67033" = "o acesso ao banco de dados de assinaturas foi negado";

/* errSecCSSigDBAccess */
"-67032" = "não foi possível ter acesso ao banco de dados de assinaturas";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "host inválido retornado ou atributos de convidado inconsistentes";

/* errSecMisc_dskFulErr */
"-34" = "O disco está cheio.";

/* errSecMisc_nsvErr */
"-35" = "O disco não pôde ser encontrado. Talvez tenha sido ejetado.";

/* errSecMisc_bdNamErr */
"-37" = "Tentou abrir um arquivo cujo nome contém um caractere ilegal.";

/* errSecMisc_fnfErr */
"-43" = "O arquivo não pôde ser encontrado.";

/* errSecMisc_wPrErr */
"-44" = "O disco está protegido contra gravação.";

/* errSecMisc_fLckdErr */
"-45" = "O arquivo está bloqueado.";

/* errSecMisc_vLckdErr */
"-46" = "O volume está bloqueado.";

/* errSecMisc_fBsyErr */
"-47" = "O arquivo está ocupado. Talvez esteja sendo usado por outro aplicativo.";

/* errSecMisc_dupFNErr */
"-48" = "Já existe um arquivo com o mesmo nome.";

/* errSecMisc_opWrErr */
"-49" = "O arquivo já está aberto com permissão para gravação.";

/* errSecMisc_volOffLinErr */
"-53" = "O volume não está mais disponível. Talvez tenha sido ejetado.";

/* errSecMisc_permErr */
"-54" = "O arquivo não pôde ser aberto. Talvez esteja sendo usado por outro aplicativo.";

/* errSecMisc_extFSErr */
"-58" = "Este volume não parece ser compatível.";

/* errSecMisc_wrPermErr */
"-61" = "Não foi possível gravar no arquivo. Talvez tenha sido aberto com privilégios de acesso insuficientes.";

/* errSecMisc_offLinErr */
"-65" = "O dispositivo de armazenamento não está mais disponível. Talvez tenha sido ejetado.";

/* errSecMisc_dirNFErr */
"-120" = "O diretório não pôde ser encontrado.";

/* errSecMisc_volGoneErr */
"-124" = "O volume do servidor não está mais disponível. Talvez tenha sido desconectado.";

/* errSecMisc_userCanceledErr */
"-128" = "A operação foi cancelada pelo usuário.";

/* errSecMisc_resNotFound */
"-192" = "Não foi encontrado um recurso necessário.";

/* errSecMisc_resFNotFound */
"-193" = "Um recurso necessário está faltando ou está danificado.";

/* errSecMisc_icNoURLErr */
"-673" = "A localização especificada (URL) é de um tipo desconhecido ou não contém suficiente informação.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Não foi possível encontrar um aplicativo auxiliar para abrir a URL especificada.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "A localização (URL) deste item está faltando ou está formatada de forma inadequada.";

/* errSecMisc_afpAccessDenied */
"-5000" = "O acesso a este item foi negado.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Falha na Autenticação. A senha deste servidor pode ter mudado desde que o item foi adicionado às chaves.";

